linux_net_bond.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-01-24 Sat 14:53 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux - Network Bonding</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Linux - Network Bonding</h1>
<p>
Just as its name indicates, <i>network bonding</i> is a technique to bond a plurality of network interface together for load balance and a wider bandwidth.
</p>

<p>
The configuration of network bonding is simple. Taking ArchLinux for instance, the network bonding of 2 network interfaces (e.g., <code>eth0</code> and <code>eth1</code>) can be configured as follows.
</p>
<ul class="org-ul">
<li><p>
<code>/etc/systemd/network/10-bond0-eth0.network</code>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ffffff;">[</span>Match<span style="color: #ffffff;">]</span>
<span style="color: #00d3d0;">Name</span>=eth0

<span style="color: #ffffff;">[</span>Network<span style="color: #ffffff;">]</span>
<span style="color: #00d3d0;">Bond</span>=bond0
</pre>
</div></li>
<li><p>
<code>/etc/systemd/network/10-bond0-eth1.network</code>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ffffff;">[</span>Match<span style="color: #ffffff;">]</span>
<span style="color: #00d3d0;">Name</span>=eth1

<span style="color: #ffffff;">[</span>Network<span style="color: #ffffff;">]</span>
<span style="color: #00d3d0;">Bond</span>=bond0
</pre>
</div></li>
<li><p>
<code>/etc/systemd/network/10-bond0.netdev</code>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ffffff;">[</span>NetDev<span style="color: #ffffff;">]</span>
<span style="color: #00d3d0;">Name</span>=bond0
<span style="color: #00d3d0;">Kind</span>=bond

<span style="color: #ffffff;">[</span>Bond<span style="color: #ffffff;">]</span>
<span style="color: #00d3d0;">Mode</span>=802.3ad
<span style="color: #00d3d0;">LACPTransmitRate</span>=fast
<span style="color: #00d3d0;">MIIMonitorSec</span>=100ms
</pre>
</div></li>
<li><p>
<code>/etc/systemd/network/10-bond0.network</code>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ffffff;">[</span>Match<span style="color: #ffffff;">]</span>
<span style="color: #00d3d0;">Name</span>=bond0

<span style="color: #ffffff;">[</span>Network<span style="color: #ffffff;">]</span>
<span style="color: #00d3d0;">Address</span>=xxx.xxx.xxx.xxx/24
<span style="color: #00d3d0;">Gateway</span>=xxx.xxx.xxx.xxx
<span style="color: #00d3d0;">DNS</span>=xxx.xxx.xxx.xxx
</pre>
</div></li>
</ul>
</div>
</body>
</html>
